lookup.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.messageservice.globaldata.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ws:retrieveMessage>
            <!--Optional:-->
            <arg0>
                <credentials>
                    <!--Optional:-->
                    <username>?</username>
                    <!--Optional:-->
                    <password>?</password>
                    <!--Optional:-->
                    <tenant>?</tenant>
                </credentials>
                <!--Optional:-->
                <key>?</key>
                <!--Optional:-->
                <options>?</options>
            </arg0>
        </ws:retrieveMessage>
    </soapenv:Body>
</soapenv:Envelope>